КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиОрганизаций/КонтурЛогистика_НастройкиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиОрганизаций</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>String</types>
      <types>EnumRef.КонтурЛогистика_НастройкиОрганизацийДиадок</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/КонтурЛогистика_НастройкиОрганизацийДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НастройкиОрганизацийДиадок</name>
  <enumValues>
    <name>LogisticsApiKey</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытий</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДатаПЛ</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийСервисаФизическихЛицДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоказанияГСМВЭПЛ</name>
    <comment>Проверка наличия показаний ГСМ на выезде и заезде в сервисе</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОтправительПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеПолучательПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеТрН</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьВодителямВноситьПоказанияГСМ</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуДиадок</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуЛогистики</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадокДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадок</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_РежимыАвторизации/КонтурЛогистика_РежимыАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_РежимыАвторизации</name>
  <enumValues>
    <name>ЛогинИПароль</name>
  </enumValues>
  <enumValues>
    <name>ApiKey</name>
  </enumValues>
  <enumValues>
    <name>ЛогинИПарольИApiKey</name>
  </enumValues>
  <enumValues>
    <name>OIDCDeviceFlow</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция АдресСервераЛогистика() Экспорт 
	
	ИспользоватьТестовыйСервер = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	URLАдреса_Контур = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.URLАдреса_Контур();
	
	Если ИспользоватьТестовыйСервер Тогда 	
		
		АдресСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресТестовогоLogisticsAPI");
		Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
			АдресСервера = URLАдреса_Контур.ЛогистикаТестовыйAPI;
		КонецЕсли;
		
	Иначе
		
		АдресСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресLogisticsAPI");
		Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
			АдресСервера = URLАдреса_Контур.ЛогистикаAPI;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
		
		ВызватьИсключение "В настройках не указан " + ?(ИспользоватьТестовыйСервер, "тестовый", "") + " Адрес API Логистика.";
		
	КонецЕсли;	
	
	Возврат АдресСервера;
	
КонецФункции	

Функция ОрганизацияСApiKey(СписокОрганизаций = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НашиОрганизации
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&СписокОрганизаций)
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|	И КонтурЛогистика_ОрганизацииДиадок.ID <> """"
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НашиОрганизации.Ссылка КАК Орагнизация
	|ИЗ
	|	НашиОрганизации КАК НашиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_ОрганизацииДиадокНастройки
	|		ПО НашиОрганизации.Ссылка = КонтурЛогистика_ОрганизацииДиадокНастройки.ОрганизацияДиадок
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадокНастройки.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey)
	|	И (ВЫРАЗИТЬ(КонтурЛогистика_ОрганизацииДиадокНастройки.ЗначениеНастройки КАК СТРОКА(1))) <> """"";
	
	Если ЗначениеЗаполнено(СписокОрганизаций) Тогда
		Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КонтурЛогистика_ОрганизацииДиадок.Ссылка В(&СписокОрганизаций)", "ИСТИНА");
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Орагнизация;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ApiKeyЛогистика(ОрганизацияДиадокСсылка = Неопределено) Экспорт
	
	// Контроль переноса существующих настроек в новые
	ЛюбаяНашаОрганизация = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЛюбаяНашаОрганизация();
	ПереносНаНовыеНастройкиВыполнен = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПереносНастроекОрганизацииВыполнен();
	Если ПереносНаНовыеНастройкиВыполнен <> Истина Тогда 
		Справочники.КонтурЛогистика_ОрганизацииДиадок.СконвертироватьНастройкиИзСтарыхВНовые();
	КонецЕсли;
	
	Если ОрганизацияДиадокСсылка = Неопределено Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
		|ГДЕ
		|	КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey)
		|	И (ВЫРАЗИТЬ(КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК СТРОКА(1))) <> """"
		|	И НЕ КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок.ПометкаУдаления
		|	И КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок.Наш
		|	И КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок.ID <> """"";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ApiKey = ?(Выборка.Следующий(), Выборка.ЗначениеНастройки, Неопределено);
		
	Иначе
		
		ApiKey = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройкиОрганизацииДиадок(
			ОрганизацияДиадокСсылка, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey);
		
	КонецЕсли;
	
	Возврат ApiKey;
	
КонецФункции

// Параметры сервиса логистика
//
// Параметры:
//  ОрганизацияДиадокСсылка	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организация Диадок
//  Токен					 - Строка	 - токен авторизации по OIDC
//  ТочноеСовпадение		 - Булево	 - если истина, то ищем любую авторизацию.
//										   Есть случаи, когда не важно от какой организации мы получим информацию.
// 
// Возвращаемое значение:
//  Структура - См. КонтурЛогистика_API_Логистика.МанифестПараметрыСервиса
//
Функция ПараметрыСервисаЛогистика(ОрганизацияДиадокСсылка = Неопределено, Токен = Неопределено, ТочноеСовпадение = Истина) Экспорт
	
	Результат = КонтурЛогистика_API_Логистика.МанифестПараметрыСервиса(АдресСервераЛогистика());
	Результат.ОрганизацияДиадок = ОрганизацияДиадокСсылка;
	
	Если Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ApiKey
		Или Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПарольИApiKey
		Или Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль Тогда
		
		Если ТочноеСовпадение Тогда
			Результат.ApiKey = ApiKeyЛогистика(ОрганизацияДиадокСсылка);
		Иначе
			Результат.ApiKey = ApiKeyЛогистика();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ApiKey) Тогда
			Результат.АвторизацияВыполнена = Истина;
		КонецЕсли;
		
	ИначеЕсли Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		
		Если ЗначениеЗаполнено(Токен) Тогда
			
			Результат.Токен = Токен;
			Если ЗначениеЗаполнено(ОрганизацияДиадокСсылка) Тогда
				Результат.DiadocBoxId = ОрганизацияДиадокСсылка.Id;
			КонецЕсли;
			
		Иначе
			
			Если ТочноеСовпадение Тогда
				ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииПоОрганизации(ОрганизацияДиадокСсылка);
			Иначе
				ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииЛюбойОрганизации();
			КонецЕсли;
			
			Результат.Токен = ДанныеАутентификации.ТокенДоступа;
			Результат.DiadocBoxId = ДанныеАутентификации.DiadocBoxId;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.Токен) Тогда
			Результат.АвторизацияВыполнена = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вставить("НастройкиПрокси", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.НастройкиПрокси());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
